
## Plans :heavy_multiplication_x:
 
Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/98225298/runs/6276b072-231d-4c0d-a02e-1dbe3039c704).

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>
<details>
    <summary><h3>Pre Hooks</h3></summary>

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
      
      
      
```

```
    
</details>

## terraform/3.computing | default | Success :thumbsup:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/3.computing
**Workspace**: default
**Success**: :thumbsup:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/kubernetes...
- Finding latest version of hashicorp/helm...
- Installing hashicorp/kubernetes v3.0.0...
- Installed hashicorp/kubernetes v3.0.0 (signed by HashiCorp)
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # helm_release.kubernetes_dashboard will be created
+   resource "helm_release" "kubernetes_dashboard" {
+       atomic                     = false
+       chart                      = "kubernetes-dashboard"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "kubernetes-dashboard"
+       namespace                  = "kubernetes-dashboard"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://kubernetes.github.io/dashboard/"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       take_ownership             = false
+       timeout                    = 300
+       upgrade_install            = false
+       values                     = [
+           <<-EOT
                "api":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "250m"
                        "memory": "256Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "128Mi"
                "app":
                  "ingress":
                    "enabled": false
                "kong":
                  "proxy":
                    "http":
                      "enabled": true
                      "servicePort": 8443
                  "service":
                    "nodePorts":
                      "http": 30443
                    "type": "NodePort"
                "web":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "150m"
                        "memory": "128Mi"
                      "requests":
                        "cpu": "50m"
                        "memory": "64Mi"
            EOT,
        ]
+       verify                     = false
+       version                    = "7.10.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_cluster_role_binding.dashboard_admin will be created
+   resource "kubernetes_cluster_role_binding" "dashboard_admin" {
+       id = (known after apply)
+
       metadata {
+           generation       = (known after apply)
+           name             = "dashboard-admin"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
+
       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "cluster-admin"
        }
+
       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "dashboard-admin"
+           namespace = "kubernetes-dashboard"
        }
    }

  # kubernetes_namespace.dashboard will be created
+   resource "kubernetes_namespace" "dashboard" {
+       id                               = (known after apply)
+       wait_for_default_service_account = false
+
       metadata {
+           generation       = (known after apply)
+           name             = "kubernetes-dashboard"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.dashboard_admin_token will be created
+   resource "kubernetes_secret" "dashboard_admin_token" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/service-account-token"
+       wait_for_service_account_token = true
+
       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "dashboard-admin"
            }
+           generation       = (known after apply)
+           name             = "dashboard-admin-token"
+           namespace        = "kubernetes-dashboard"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard will be created
+   resource "kubernetes_service_account" "dashboard" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)
+
       metadata {
+           generation       = (known after apply)
+           name             = "kubernetes-dashboard"
+           namespace        = "kubernetes-dashboard"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dashboard_admin will be created
+   resource "kubernetes_service_account" "dashboard_admin" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)
+
       metadata {
+           generation       = (known after apply)
+           name             = "dashboard-admin"
+           namespace        = "kubernetes-dashboard"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   dashboard_port_forward_command = "kubectl -n kubernetes-dashboard port-forward svc/kubernetes-dashboard-kong-proxy 8443:443"
+   dashboard_token_command        = "kubectl -n kubernetes-dashboard get secret dashboard-admin-token -o jsonpath='{.data.token}' | base64 -d"
+   dashboard_url                  = "https://<VPS_IP>:30443"

```
</details>

## . | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## .github/workflows | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: .github/workflows
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## .terrateam | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: .terrateam
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## docs | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: docs
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## docs/change_log | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: docs/change_log
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## docs/project | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: docs/project
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :heavy_multiplication_x:

```
╷
│ Error: Unsupported Terraform Core version
│ 
│   on providers.tf line 2, in terraform:
│    2:   required_version = ">= 1.6.0"
│ 
│ This configuration does not support Terraform version 1.5.7. To proceed,
│ either choose another supported Terraform version or update this version
│ constraint. Version constraints are normally set for good reason, so
│ updating the constraint may lead to other errors or unexpected behavior.
╵



Initializing the backend...
Initializing modules...
Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/1.nodep | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/1.nodep
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/local...
- Finding latest version of hashicorp/null...
- Installing hashicorp/local v2.6.1...
- Installed hashicorp/local v2.6.1 (signed by HashiCorp)
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "vps_host" {}
│ 
│ The root module input variable "vps_host" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "vps_user" {}
│ 
│ The root module input variable "vps_user" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "ssh_port" {}
│ 
│ The root module input variable "ssh_port" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 4:
│    4: variable "ssh_private_key" {}
│ 
│ The root module input variable "ssh_private_key" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "cluster_name" {}
│ 
│ The root module input variable "cluster_name" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "api_endpoint" {}
│ 
│ The root module input variable "api_endpoint" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 7:
│    7: variable "k3s_channel" {}
│ 
│ The root module input variable "k3s_channel" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 8:
│    8: variable "k3s_version" {}
│ 
│ The root module input variable "k3s_version" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 9:
│    9: variable "disable_components" {}
│ 
│ The root module input variable "disable_components" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 10:
│   10: variable "kubeconfig_path" {}
│ 
│ The root module input variable "kubeconfig_path" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/1.nodep/scripts | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/1.nodep/scripts
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/2.env_and_networking | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/2.env_and_networking
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/kubernetes...
- Finding latest version of hashicorp/helm...
- Finding latest version of hashicorp/random...
- Installing hashicorp/kubernetes v3.0.0...
- Installed hashicorp/kubernetes v3.0.0 (signed by HashiCorp)
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed by HashiCorp)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "kubeconfig_path" {}
│ 
│ The root module input variable "kubeconfig_path" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "domain_prefix" {}
│ 
│ The root module input variable "domain_prefix" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 3:
│    3: variable "base_domain" {}
│ 
│ The root module input variable "base_domain" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 4:
│    4: variable "infisical_chart_version" {}
│ 
│ The root module input variable "infisical_chart_version" is not set, and
│ has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "infisical_image_tag" {}
│ 
│ The root module input variable "infisical_image_tag" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "infisical_postgres_password" {}
│ 
│ The root module input variable "infisical_postgres_password" is not set,
│ and has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 7:
│    7: variable "infisical_postgres_storage" {}
│ 
│ The root module input variable "infisical_postgres_storage" is not set, and
│ has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 8:
│    8: variable "namespaces" {
│ 
│ The root module input variable "namespaces" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/4.storage | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/4.storage
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/5.insight | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/5.insight
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## terraform/envs | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: terraform/envs
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

## tools | default | :heavy_multiplication_x:
<details>
  <summary>Expand for details</summary>

---

  
**Dir**: tools
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: No configuration files
│ 
│ Plan requires configuration to be present. Planning without a configuration
│ would mark everything for destruction, which is normally not what is
│ desired. If you would like to destroy everything, run plan with the
│ -destroy option. Otherwise, create a Terraform configuration file (.tf
│ file) and try again.
╵

Failure during /github/home/.tenv/Terraform/1.5.7/terraform call : exited with code 1

```
</details>

</details>

## Cost Estimation

**Error calculating Cost Estimation**
<details>
  <summary>Expand for cost estimation details</summary>

```
'terraformWorkspace'
```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>